#######################################################################################################################
# 전체 py 파일 실행 => Linux 환경에서는 .sh 파일로 변환 필요
#######################################################################################################################
# 코인 뉴스기사 및 일별 데이터(바이낸스, 업비트) 크롤링 실행
import coin_crawling
print('#'*40)
print('#'*40)
# 크롤링 데이터 => 텍스트 분석
import coin_text_analysis
print('#'*40)
print('#'*40)
# 분석 결과 시각화
import app_js
print('#'*40)
print('#'*40)



